In [36]:
import pandas as pd
import re

In [2]:
# reading the excel sheet
df = pd.read_excel('DataSetOne.xlsx',sheet_name='Sheet1')

In [3]:
df.shape

(8, 3)

In [4]:
# checking the head of the data
df.head(10)

   employee_id             name              email
0            1  Aarati Shrestha    aarati@fuse.com
1            2       Birat Bade     birat@fuse.com
2            2       Birat Bade    birat@gmail.com
3            3      Arpan Aryal     arpan@fuse.com
4            4   Shekhar Khadka    shekhar@fuse.co
5            4   Shekhar Khadka  shekhar@gmail.com
6            4   Shekhar Khadka    shekhargmail.co
7            5   Santosh Silwal                NaN

In [5]:
# sorting by name column
df = df.sort_values(by=['name'])

In [6]:
df.head(10)

   employee_id             name              email
0            1  Aarati Shrestha    aarati@fuse.com
3            3      Arpan Aryal     arpan@fuse.com
1            2       Birat Bade     birat@fuse.com
2            2       Birat Bade    birat@gmail.com
7            5   Santosh Silwal                NaN
4            4   Shekhar Khadka    shekhar@fuse.co
5            4   Shekhar Khadka  shekhar@gmail.com
6            4   Shekhar Khadka    shekhargmail.co

In [14]:
# filtering out df which dont have any email
df_without_email = df[df['email'].isnull()]

In [15]:
df_without_email

   employee_id            name email
7            5  Santosh Silwal   NaN

In [17]:
df_with_email = df[df['email'].notnull()]

In [21]:
df_with_email

   employee_id             name              email
0            1  Aarati Shrestha    aarati@fuse.com
3            3      Arpan Aryal     arpan@fuse.com
1            2       Birat Bade     birat@fuse.com
2            2       Birat Bade    birat@gmail.com
4            4   Shekhar Khadka    shekhar@fuse.co
5            4   Shekhar Khadka  shekhar@gmail.com
6            4   Shekhar Khadka    shekhargmail.co

In [19]:
# let's work with df which has email

In [30]:
# ~ is to use complement of df
fuse_email = df_with_email[~df_with_email.email.str.contains("gmail", na=False)]

In [31]:
fuse_email

   employee_id             name            email
0            1  Aarati Shrestha  aarati@fuse.com
3            3      Arpan Aryal   arpan@fuse.com
1            2       Birat Bade   birat@fuse.com
4            4   Shekhar Khadka  shekhar@fuse.co

In [33]:
gmail_email = df_with_email[df_with_email.email.str.contains("gmail", na=False)]

In [35]:
gmail_email

   employee_id            name              email
2            2      Birat Bade    birat@gmail.com
5            4  Shekhar Khadka  shekhar@gmail.com
6            4  Shekhar Khadka    shekhargmail.co

In [47]:
regex = "com$"
df_with_email

   employee_id             name              email
0            1  Aarati Shrestha    aarati@fuse.com
3            3      Arpan Aryal     arpan@fuse.com
1            2       Birat Bade     birat@fuse.com
2            2       Birat Bade    birat@gmail.com
4            4   Shekhar Khadka    shekhar@fuse.co
5            4   Shekhar Khadka  shekhar@gmail.com
6            4   Shekhar Khadka    shekhargmail.co

In [48]:
valid_email = df_with_email[df_with_email.email.str.contains(regex, na=False)]

In [50]:
valid_email

   employee_id             name              email
0            1  Aarati Shrestha    aarati@fuse.com
3            3      Arpan Aryal     arpan@fuse.com
1            2       Birat Bade     birat@fuse.com
2            2       Birat Bade    birat@gmail.com
5            4   Shekhar Khadka  shekhar@gmail.com

In [52]:
invalid_email = df_with_email[~df_with_email.email.str.contains(regex, na=False)]

In [54]:
invalid_email

   employee_id            name            email
4            4  Shekhar Khadka  shekhar@fuse.co
6            4  Shekhar Khadka  shekhargmail.co

In [55]:
! pip freeze > requirements.txt